{"success":true,"message":"All Hadist","data":{"current_page":1,"data":[{"id":42,"title":"Allah Maha Pengampun","source":"Arbain Nawawi","text":"عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ: قَالَ اللهُ تبارك و تَعَالَى: “يَا ابْنَ آَدَمَ إِنَّكَ مَا دَعَوْتَنِيْ وَرَجَوْتَنِيْ غَفَرْتُ لَكَ عَلَى مَا كَانَ فيك وَلا أُبَالِيْ، يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوْبُكَ عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتَنِيْ غَفَرْتُ لَكَ و لا أبالي، يَا ابْنَ آَدَمَ إِنَّكَ لَوْ أَتَيْتَنِيْ بِقُرَابِ الأَرْضِ خَطَايَا ثُمَّ لقِيْتَنِيْ لاَتُشْرِكُ بِيْ شَيْئَاً لأَتَيْتُكَ بِقُرَابِهَا مَغفِرَةً” رَوَاهُ التِّرْمِذِيُّ وَقَالَ: حَدِيْثٌ حَسَنٌ صَحَيْحٌ","translation":"Dari Anas bin Malik radhiyallahu ‘anhu dia berkata: ‘Aku mendengar Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Allah berfirman: ”Wahai Bani Adam, sesungguhnya jika engkau senantiasa berdoa dan berharap kepada–Ku niscaya Aku akan mengampunimu semua dosa yang ada padamu dan Aku tidak peduli. Wahai anak Adam kalau seandainya dosamu setinggi langit, kemudian engkau memohon ampun kepada– Ku, niscaya aku akan memberikan ampunan kepadamu dan Aku tidak peduli. Wahai anak Adam seandainya engkau menghadap kepada–Ku dengan membawa dosa sepenuh bumi kemudian engkau berjumpa dengan–Ku dalam keadaan tidak menyekutukanKu dengan sesuatu apapun, niscaya Aku akan mendatangimu dengan ampunan sepenuh bumi pula.” (HR. At Tirmidzi)","category":"Shahih","noted":"Diriwayatkan oleh At Tirmidzi (3540), Ath Thabrani dalam al Ausath (4\/315) dari hadits Anas radhiyallahu ‘anhu. Abu Isa (At Tirmidzi ) berkata: “Ini adalah hadits gharib (diriwayatkan dengan 1 jalan), tidaklah kami mengetahuinya kecuali hanya dari jalan ini.” Diriwayatkan juga dari shahabat Abu Dzar radhiyallahu ‘anhu oleh Ahmad dalam Musnadnya (5\/148), Ad Darimi (2788), Al Bazzar (9\/403), Al Hakim dalam al Mustadrak (4\/269), dan dia berkata: “Hadits ini sanadnya  shahih namun Al Imam Al Bukhari dan Muslim tidak mengeluarkannya.”","created_at":"2023-09-22T04:33:53.000000Z","updated_at":"2023-09-22T04:33:53.000000Z"},{"id":41,"title":"Hingga Hawa Nafsunya Mengikuti Apa yang Aku Bawa","source":"Arbain Nawawi","text":"عَنْ أَبِيْ مُحَمَّدٍ عَبْدِ اللهِ بِنِ عمْرِو بْنِ العَاصِ رَضِيَ اللهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم : “لاَيُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَواهُ تَبَعَاً لِمَا جِئْتُ بِهِ” حَدِيْثٌ حَسَنٌ صَحِيْحٌ رَوَيْنَاهُ فِي كِتَابِ الحُجَّةِ بِإِسْنَادٍ صَحِيْحٍ","translation":"“Dari Abu Muhammad Abdullah  bin Amr bin Al Ash radhiyallahu ‘anhuma, dia berkata: ”Rasulullah shallallahu ‘alaihi wa sallam bersabda: ”Tidaklah sempurna keimanan salah seorang di antara kalian hingga hawa nafsunya mau mengikuti apa yang aku bawa.” (Hadits hasan shahih, kami telah meriwayatkannya dari kitab Al Hujjah dengan sanad shahih)","category":"Shahih","noted":"Diriwayatkan oleh Al Baghawi dalam Syarhus Sunnah (1\/212) , Ibnu Abi ‘Ashim dalam as Sunnah (1\/12), Al Baihaqi dalam al Madkhal Ilas Sunnan al Kubra (1\/88) dan dia berkata: ”Nu’aim bin Hammad bersendirian dalam meriwayatkan hadits ini”, Al Khatib dalam Tarikh al Baghdad (4\/368). Lihat kritikan tentang lemahnya hadits ini dalam Jami’ul ‘Ulum Wal Hikam (hal 387–388)","created_at":"2023-09-22T04:32:43.000000Z","updated_at":"2023-09-22T04:32:43.000000Z"},{"id":40,"title":"Jadilah Engkau di Dunia ini seperti Orang Asing","source":"Arbain Nawawi","text":"عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللهِ صلى الله عليه وسلم بِمنْكِبَيَّ فَقَالَ: (كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيْبٌ أَوْ عَابِرُ سَبِيْلٍ) وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ: إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ. وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لمَوْتِكَ. رَوَاهُ الْبُخَارِيُّ\"","translation":"Dari Ibnu Umar radhiyallahu ‘anhuma dia berkata: “Suatu hari Rasulullah shallallahu ‘alaihi wa sallam memegang kedua pundakku seraya bersabda: ”Jadilah engkau di dunia ini seperti orang asing atau pengembara”. Maka Ibnu ‘Umar radhiyallahu ‘anhuma menyatakan: “Jika engkau berada di sore hari janganlah engkau menunggu datangnya esok hari. Jika engkau berada di pagi hari, janganlah engkau menunggu datangnya sore hari. Pergunakanlah masa sehatmu untuk menghadapi masa sakitmu, dan masa hidupmu untuk menghadapi masa kematianmu.” (HR. Al Bukhari)\"","category":"Shahih","noted":"Diriwayatkan oleh al Bukhari  (6416)\"","created_at":"2023-09-22T04:31:18.000000Z","updated_at":"2023-09-22T04:31:37.000000Z"},{"id":39,"title":"Allah Mengampuni Siapa yang Bersalah dan Lupa","source":"Arbain Nawawi","text":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَال: (إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوْا عَلَيْهِ) حَدِيْثٌ حَسَنٌ رَوَاهُ ابْنُ مَاجَه وَاْلبَيْهَقِيّ وَغَيْرُهُمَا","translation":"Dari Ibnu Abbas radhiyallahu ‘anhuma bahwa Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Sesungguhnya Allah membiarkan(mengampuni) kesalahan dari umatku akibat kekeliruan dan lupa serta keterpaksaan.” (Hadits Hasan diriwayatkan oleh Ibnu Majah dan Al Baihaqi serta selain keduanya)","category":"Shahih","noted":"Diriwayatkan oleh Ibnu Majah (2045), Ibnu Hibban dalam Shahihnya (16\/202), Ath Thabrani dalam al Kabir (11274), Al Hakim dalam al Mustadrak (2\/216) , Ad Daruquthni dalam Sunannya (4\/170) dan Al Baihaqi dalam al Kubra (7\/356)","created_at":"2023-09-22T04:30:17.000000Z","updated_at":"2023-09-22T04:30:17.000000Z"},{"id":38,"title":"Cara Mendapatkan Kecintaan AllahCara Mendapatkan Kecintaan Allah","source":"Arbain Nawawi","text":"عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: (إِنَّ اللهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيَّاً فَقَدْ آذَنْتُهُ بِالحَرْبِ. وَمَا تَقَرَّبَ إِلِيَّ عَبْدِيْ بِشَيءٍ أَحَبَّ إِلِيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ. ولايَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبتُهُ كُنْتُ سَمْعَهُ الَّذِيْ يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِيْ يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِيْ بِهَا. وَلَئِنْ سَأَلَنِيْ لأُعطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِيْ لأُعِيْذَنَّهُ) رَوَاهُ اْلبُخَارِيُّ","translation":"Dari Abu Hurairah radhiyallahu ‘anhu, dia berkata: ‘Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Sesungguhnya Allah berfirman: ”Barangsiapa yang memusuhi wali-Ku, maka Aku menyatakan perang kepadanya. Tidaklah seorang hamba–Ku mendekatkan diri kepada–Ku dengan sesuatu yang lebih  Aku cintai daripada hal–hal yang telah Aku wajibkan baginya. Senantiasa hamba–Ku mendekatkan diri kepada–Ku dengan amalan–amalan nafilah (sunnah) hingga Aku mencintainya. Apabila Aku telah mencintainya maka Aku menjadi pendengarannya yang dia gunakan untuk mendengar, Aku menjadi penglihatannya yang dia gunakan untuk melihat, Aku menjadi tangannya yang dia gunakan untuk memegang  dan Aku menjadi kakinya yang dia gunakan untuk melangkah. Jika dia meminta kepada–Ku pasti Aku memberinya dan jika dia meminta perlindungan kepada–Ku pasti Aku akan melindunginya.” (HR. Al Bukhari)","category":"Shahih","noted":"Diriwayatkan oleh al Bukhari (6502)","created_at":"2023-09-22T04:29:11.000000Z","updated_at":"2023-09-22T04:29:11.000000Z"}],"first_page_url":"http:\/\/localhost:8000\/api\/hadist?page=1","from":1,"last_page":9,"last_page_url":"http:\/\/localhost:8000\/api\/hadist?page=9","links":[{"url":null,"label":"&laquo; Previous","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=1","label":"1","active":true},{"url":"http:\/\/localhost:8000\/api\/hadist?page=2","label":"2","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=3","label":"3","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=4","label":"4","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=5","label":"5","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=6","label":"6","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=7","label":"7","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=8","label":"8","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=9","label":"9","active":false},{"url":"http:\/\/localhost:8000\/api\/hadist?page=2","label":"Next &raquo;","active":false}],"next_page_url":"http:\/\/localhost:8000\/api\/hadist?page=2","path":"http:\/\/localhost:8000\/api\/hadist","per_page":5,"prev_page_url":null,"to":5,"total":42}}